app/controllers/urls_controller.rb

  def create
    @url = Url.new(url_params)

    if @url.save
---
INSERT INTO "urls" ("original_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["original_url", "https://www.jetbrains.com/help/ruby/2016.2/zooming-in-the-editor.html"], ["created_at", 2016-10-26 17:56:23 UTC], ["updated_at", 2016-10-26 17:56:23 UTC]]

  def redirect
    @id = params[:id]
    if @id != nil
      @url = Url.find_by(short_id: params[:id])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_id" = $1 LIMIT $2  [["short_id", "76301e"], ["LIMIT", 1]]